GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from brokengdb1.o...done.
(gdb) run [K
Starting program: /home/micah1711/EE355-Lab5/brokengdb1.o 
Please enter n:

Program received signal SIGSEGV, Segmentation fault.
0x0000555555554ab7 in factorial (n=<error reading variable: Cannot access memory at address 0x7fffff7feffc>) at brokengdb1.cpp:19
19	{
(gdb) break 18
Breakpoint 1 at 0x555555554aba: file brokengdb1.cpp, line 18.
(gdb) run
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/micah1711/EE355-Lab5/brokengdb1.o 
Please enter n:

Breakpoint 1, factorial (n=5) at brokengdb1.cpp:21
21	    if(n)
(gdb) n
22	        return  factorial(n--)*n;
(gdb) n

Breakpoint 1, factorial (n=5) at brokengdb1.cpp:21
21	    if(n)
(gdb) n
22	        return  factorial(n--)*n;
(gdb) n

Breakpoint 1, factorial (n=5) at brokengdb1.cpp:21
21	    if(n)
(gdb) n
22	        return  factorial(n--)*n;
(gdb) n

Breakpoint 1, factorial (n=5) at brokengdb1.cpp:21
21	    if(n)
(gdb) n
22	        return  factorial(n--)*n;
(gdb) n

Breakpoint 1, factorial (n=5) at brokengdb1.cpp:21
21	    if(n)
(gdb) print n
$1 = 5
(gdb) quit
A debugging session is active.

	Inferior 1 [process 5370] will be killed.

Quit anyway? (y or n) y[Ky
